# The pandas DataFrame Object

A DataFrame represents a rectangular table of data and contains an ordered collection of columns,each of which can be a different 
value type(numeric,string,boolean,etc)

creating a DataFrame from scratch

In [2]:
# create a DataFrame from a 2-d ndarray

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.array([[10,11,12,13],[20,21,22,23]]))
df
# default row and columns indexs

    0   1   2   3
0  10  11  12  13
1  20  21  22  23

In [3]:
# create  a DataFrame for a list of Series objects

df1 = pd.DataFrame([pd.Series(np.arange(10, 15)), pd.Series(np.arange(15, 20))])
df1
#default row and columns indexes

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [4]:
# create a DataFrame with two Series objects
# and a dictionary
s1 = pd.Series(np.arange(1,6,1))
s2 = pd.Series(np.arange(6,11,1))

df2 = pd.DataFrame({'boys': s1, 'girls': s2})
df2

   boys  girls
0     1      6
1     2      7
2     3      8
3     4      9
4     5     10

In [5]:
data = {'name':["Asad", "saad", "Fahd", "Ali"], 'age':[23,34,23,21], "grades":["A","B","A","B"]}
data = pd.DataFrame(data)
data

   name  age grades
0  Asad   23      A
1  saad   34      B
2  Fahd   23      A
3   Ali   21      B

In [6]:
# specify column names
df3 = pd.DataFrame(np.array([[10, 11], [20, 21]]),columns = ['apples', 'oranges'])
df3

   apples  oranges
0      10       11
1      20       21

In [7]:
# create a DataFrame with named columns and rows

df4 = pd.DataFrame(np.array([[10, 11, 12, 13],[20, 21, 22, 23]]),  index = ['apples','oranges'], columns = ['Mon','Tue', 'Wed', 'Thu'])
df4

         Mon  Tue  Wed  Thu
apples    10   11   12   13
oranges   20   21   22   23

In [8]:
# demonstrate alignment during creation
s3 = pd.Series(np.arange(12,14), index = [1, 2])

df5 = pd.DataFrame({'c1': s1, 'c2': s2, 'c3':s3})
df5

   c1  c2    c3
0   1   6   NaN
1   2   7  12.0
2   3   8  13.0
3   4   9   NaN
4   5  10   NaN

In [9]:
# Examples of creating data frames
data = {'state': ['Ohio','Ohio','Ohio','Nevanda','Nevanda','Nevanda'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5,1.7,3.6, 2.4,2.9,3.2]}

frame = pd.DataFrame(data)
frame

     state  year  pop
0     Ohio  2000  1.5
1     Ohio  2001  1.7
2     Ohio  2002  3.6
3  Nevanda  2001  2.4
4  Nevanda  2002  2.9
5  Nevanda  2003  3.2

In [10]:
pd.DataFrame(frame, columns = ['year', 'state', 'pop']) #  not in place

   year    state  pop
0  2000     Ohio  1.5
1  2001     Ohio  1.7
2  2002     Ohio  3.6
3  2001  Nevanda  2.4
4  2002  Nevanda  2.9
5  2003  Nevanda  3.2

In [11]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [12]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [13]:
# If you pass a column that is not contained in the dict(debt), it will appear with missing values 
# in the result:
frame2 =pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], index = ['one','two','three', 'four', 'five', 'six'])
frame2

       year    state  pop debt
one    2000     Ohio  1.5  NaN
two    2001     Ohio  1.7  NaN
three  2002     Ohio  3.6  NaN
four   2001  Nevanda  2.4  NaN
five   2002  Nevanda  2.9  NaN
six    2003  Nevanda  3.2  NaN

In [14]:
frame2.debt = 100
frame2

       year    state  pop  debt
one    2000     Ohio  1.5   100
two    2001     Ohio  1.7   100
three  2002     Ohio  3.6   100
four   2001  Nevanda  2.4   100
five   2002  Nevanda  2.9   100
six    2003  Nevanda  3.2   100

In [15]:
frame2['debt'] = np.arange(6)
frame2

       year    state  pop  debt
one    2000     Ohio  1.5     0
two    2001     Ohio  1.7     1
three  2002     Ohio  3.6     2
four   2001  Nevanda  2.4     3
five   2002  Nevanda  2.9     4
six    2003  Nevanda  3.2     5

In [16]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [17]:
frame2['debt'] = val
frame2

       year    state  pop  debt
one    2000     Ohio  1.5   NaN
two    2001     Ohio  1.7  -1.2
three  2002     Ohio  3.6   NaN
four   2001  Nevanda  2.4  -1.5
five   2002  Nevanda  2.9  -1.7
six    2003  Nevanda  3.2   NaN

In [18]:
# Adding more columns to dataframe

frame2['eastern'] = frame2.state == 'Ohio' # true false
frame2

       year    state  pop  debt  eastern
one    2000     Ohio  1.5   NaN     True
two    2001     Ohio  1.7  -1.2     True
three  2002     Ohio  3.6   NaN     True
four   2001  Nevanda  2.4  -1.5    False
five   2002  Nevanda  2.9  -1.7    False
six    2003  Nevanda  3.2   NaN    False

In [19]:
frame2['pop_greaterThan2'] = frame2['pop'] > 2
frame2

       year    state  pop  debt  eastern  pop_greaterThan2
one    2000     Ohio  1.5   NaN     True             False
two    2001     Ohio  1.7  -1.2     True             False
three  2002     Ohio  3.6   NaN     True              True
four   2001  Nevanda  2.4  -1.5    False              True
five   2002  Nevanda  2.9  -1.7    False              True
six    2003  Nevanda  3.2   NaN    False              True

In [20]:
del frame2['eastern']

In [21]:
frame2

       year    state  pop  debt  pop_greaterThan2
one    2000     Ohio  1.5   NaN             False
two    2001     Ohio  1.7  -1.2             False
three  2002     Ohio  3.6   NaN              True
four   2001  Nevanda  2.4  -1.5              True
five   2002  Nevanda  2.9  -1.7              True
six    2003  Nevanda  3.2   NaN              True

In [22]:
data = {'name': ["Asad", "saad", "Fahd", "Ali"], "Age": [23,34,23,21],'AI for EveryONE': [89,78,90,98],
       'PYTHON':[78,89,87,90], 'git': [90,98,87,86], 'numpy': [98,87,98,99]}
data = pd.DataFrame(data)
data

   name  Age  AI for EveryONE  PYTHON  git  numpy
0  Asad   23               89      78   90     98
1  saad   34               78      89   98     87
2  Fahd   23               90      87   87     98
3   Ali   21               98      90   86     99

In [23]:
data["Total"] = data["AI for EveryONE"]+data["PYTHON"]+data["git"]+data["numpy"]
data

   name  Age  AI for EveryONE  PYTHON  git  numpy  Total
0  Asad   23               89      78   90     98    355
1  saad   34               78      89   98     87    352
2  Fahd   23               90      87   87     98    362
3   Ali   21               98      90   86     99    373

In [24]:
#Another common form of data is a nested dict of dicts:
pop = {"nevada": {2001: 2.4, 2002: 2.9},
      "Ohio":  {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df3 = pd.DataFrame(pop)
df3

      nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as the columns and the inner keys as the row indices

In [25]:
df3.T

        2001  2002  2000
nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [26]:
pop1 = pd.DataFrame(pop, index = [2001, 2002, 2003])
pop1

      nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [27]:
pdata = {"Ohio": df3["Ohio"][:-1],
        "nevada": df3["nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  nevada
2001   1.7     2.4
2002   3.6     2.9

# index Objects

pandas's index objects are responsible for holding the axis labels and other metadata(like the axis names).Any array or other sequence of labels you
use when constructing a Series or DataFrame is internally converted to an index:

In [28]:
obj = pd.Series(range(3), index = ['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [29]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [30]:
index[1:]

Index(['b', 'c'], dtype='object')

In [31]:
index[1] = 'd' # indices are immutable

TypeError: Index does not support mutable operations

In [35]:
labels = pd.Index(['a','b','c','d','e','f']) # create index ndarray that is immutable
# coz created via index Index function and index are immutable
labels

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [36]:
labels[0] = "z"

TypeError: Index does not support mutable operations

In [37]:
print(frame)

     state  year  pop
0     Ohio  2000  1.5
1     Ohio  2001  1.7
2     Ohio  2002  3.6
3  Nevanda  2001  2.4
4  Nevanda  2002  2.9
5  Nevanda  2003  3.2

In [38]:
frame.index=labels
frame

     state  year  pop
a     Ohio  2000  1.5
b     Ohio  2001  1.7
c     Ohio  2002  3.6
d  Nevanda  2001  2.4
e  Nevanda  2002  2.9
f  Nevanda  2003  3.2

In [39]:
frame.index  # is index type object

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [40]:
frame.columns  # is also index type object

Index(['state', 'year', 'pop'], dtype='object')

# Essential Functionality

In [44]:
frame2['debt'] = np.arange(6)
print("The frame is" , end = "\n\n")
print(frame2,end="\n\n")
print("The row indices are", end="\n\n")
print(frame2.index,end="\n\n")
print("The col indices are", end = "\n\n")
print(frame2.columns)

The frame is

       year    state  pop  debt  pop_greaterThan2
one    2000     Ohio  1.5     0             False
two    2001     Ohio  1.7     1             False
three  2002     Ohio  3.6     2              True
four   2001  Nevanda  2.4     3              True
five   2002  Nevanda  2.9     4              True
six    2003  Nevanda  3.2     5              True

The row indices are

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

The col indices are

Index(['year', 'state', 'pop', 'debt', 'pop_greaterThan2'], dtype='object')

In [46]:
##### by default row are reindexed via reindex function#####
reindex_frame = frame2.reindex(['five', 'two','three','six','four','one','seven'])
reindex_frame

         year    state  pop  debt pop_greaterThan2
five   2002.0  Nevanda  2.9   4.0             True
two    2001.0     Ohio  1.7   1.0            False
three  2002.0     Ohio  3.6   2.0             True
six    2003.0  Nevanda  3.2   5.0             True
four   2001.0  Nevanda  2.4   3.0             True
one    2000.0     Ohio  1.5   0.0            False
seven     NaN      NaN  NaN   NaN              NaN

The columns can be reindexed with the columns keyword:

In [48]:
reindex_frame = frame2.reindex(columns=["pop","year","imports","debt","state","exports"])
reindex_frame

       pop  year  imports  debt    state  exports
one    1.5  2000      NaN     0     Ohio      NaN
two    1.7  2001      NaN     1     Ohio      NaN
three  3.6  2002      NaN     2     Ohio      NaN
four   2.4  2001      NaN     3  Nevanda      NaN
five   2.9  2002      NaN     4  Nevanda      NaN
six    3.2  2003      NaN     5  Nevanda      NaN

# Dropping Entries from an Axis

In [96]:
reindex_frame

       pop  year  imports  debt    state  exports
one    1.5  2000      NaN     0     Ohio      NaN
two    1.7  2001      NaN     1     Ohio      NaN
three  3.6  2002      NaN     2     Ohio      NaN
four   2.4  2001      NaN     3  Nevanda      NaN
five   2.9  2002      NaN     4  Nevanda      NaN
six    3.2  2003      NaN     5  Nevanda      NaN

In [97]:
row_dropped_frame = reindex_frame.drop(['three','six']) # not dropping inplace

# by default dropping row lablels axis = 0
row_dropped_frame

      pop  year  imports  debt    state  exports
one   1.5  2000      NaN     0     Ohio      NaN
two   1.7  2001      NaN     1     Ohio      NaN
four  2.4  2001      NaN     3  Nevanda      NaN
five  2.9  2002      NaN     4  Nevanda      NaN

In [98]:
col_dropped_frame = reindex_frame.drop(['imports','exports'],axis = 1)
col_dropped_frame

       pop  year  debt    state
one    1.5  2000     0     Ohio
two    1.7  2001     1     Ohio
three  3.6  2002     2     Ohio
four   2.4  2001     3  Nevanda
five   2.9  2002     4  Nevanda
six    3.2  2003     5  Nevanda

# Another Example:

In [99]:
index = ['Firefox', 'Chrome','Safari','IE10','konqueror']
df = pd.DataFrame({'http_status': [200,200,404,404,301],'response_time':[0.04, 0.02, 0.07, 0.08, 1.0]}, index = index)
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
konqueror          301           1.00

Create a new index and reindex the dataframe.By default values in the new index that do not have corresponding records in the 
dataframe are assigned NaN.

In [100]:
new_index = ['Safari', 'Iceweasel','Comondo Dragon', 'IE10','Chrome']
df.reindex(new_index)

                http_status  response_time
Safari                404.0           0.07
Iceweasel               NaN            NaN
Comondo Dragon          NaN            NaN
IE10                  404.0           0.08
Chrome                200.0           0.02

We can fill in the missing values by passing a value to the keyword fill_value.Because the index is not monotonically increasing 
or decreasing,we cannot use arguments to the keyword method to fill the NaN Values.

In [101]:
df.reindex(new_index, fill_value=0)

                http_status  response_time
Safari                  404           0.07
Iceweasel                 0           0.00
Comondo Dragon            0           0.00
IE10                    404           0.08
Chrome                  200           0.02

In [102]:
df.reindex(new_index, fill_value = 'missing')

               http_status response_time
Safari                 404          0.07
Iceweasel          missing       missing
Comondo Dragon     missing       missing
IE10                   404          0.08
Chrome                 200          0.02

In [103]:
# we can also reindex the columns.
df.reindex(columns = ['http_status','user_agent'])

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
konqueror          301         NaN

In [104]:
# or we can use "axis-style" keyword arguments
df.reindex(['http_status', 'user-agent'], axis = "columns")

           http_status  user-agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
konqueror          301         NaN

To further illustrate the filling functionality in reindex,we will create a dataframe with a monotonically increasing index(for
example,a sequence of dates)

In [105]:
date_index = pd.date_range('1/1/2010', periods =6, freq = 'D')

df2 = pd.DataFrame({"prices":[100, 101, np.nan, 100, 89, 88]}, index = date_index)
df2

            prices
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0

suppose we decide to expand the dataframe to cover a winder date range.

In [106]:
date_index2 = pd.date_range('12/29/2009', periods = 10, freq = "D")
df2.reindex(date_index2)

            prices
2009-12-29     NaN
2009-12-30     NaN
2009-12-31     NaN
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07     NaN

The index entries theat did not have a value in the original data frame (for example,'2009-12-29') are by default filled with NaN
.If desired,we can fill in the missing values using one of several options.

For example,to back-propagate the last valid value to fill the NaN values, pass bfill as an argument to the method keyword.

In [107]:
df2.reindex(date_index2, method = 'bfill')

            prices
2009-12-29   100.0
2009-12-30   100.0
2009-12-31   100.0
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07     NaN

Please note thata the NaN value preset in teh original dataframe(at index value 2010-01-03) will not be filled by any of the value 
propagation schemes.This is because filling while reindexing does not look at dataframe values, but only compares the original and desired indexes.If you do want to fill in the
NaN values present in the original dataframe,use the fillna()method.

# Indexing,Selection and Filtering

In [108]:
data = pd.DataFrame(np.arange(40).reshape((10, 4)), index = ['Ohio','Colorado','Washington','Nebraska','Utah','New York','California','Texas','Georgia', 'Alaska'],
columns = ['jan', 'Feb', 'Mar','Apr'])
data

            jan  Feb  Mar  Apr
Ohio          0    1    2    3
Colorado      4    5    6    7
Washington    8    9   10   11
Nebraska     12   13   14   15
Utah         16   17   18   19
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31
Georgia      32   33   34   35
Alaska       36   37   38   39

In [109]:
# getting a single col
data['jan']

Ohio           0
Colorado       4
Washington     8
Nebraska      12
Utah          16
New York      20
California    24
Texas         28
Georgia       32
Alaska        36
Name: jan, dtype: int32

In [110]:
# getting multiple cols
data[['jan', 'Apr']]

            jan  Apr
Ohio          0    3
Colorado      4    7
Washington    8   11
Nebraska     12   15
Utah         16   19
New York     20   23
California   24   27
Texas        28   31
Georgia      32   35
Alaska       36   39

In [111]:
# integer based
data[:2]  # slicing rows starts from 0 &  take two rows

          jan  Feb  Mar  Apr
Ohio        0    1    2    3
Colorado    4    5    6    7

In [112]:
# label based
data["Utah":"Texas"] # slicing rows starts from "Utah" & go to "Texas"

            jan  Feb  Mar  Apr
Utah         16   17   18   19
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31

In [113]:
data[2:6,0:2] # slicing subsets of Rows and Columns either by label index
# or by integer indexing is not possible, we have some other sol

TypeError: '(slice(2, 6, None), slice(0, 2, None))' is an invalid key

In [114]:
data["Utah":"Texas","Jan":"Mar"]# Slicing Subsets of Rows and columns either by label index
# or by integer indexing is not possible, we have some other sol

TypeError: '(slice('Utah', 'Texas', None), slice('Jan', 'Mar', None))' is an invalid key

We can select specific ranges of our data in both the row and columns directions using either label or integer-based indexing.

loc is primarily label based indexing.Integers may be used but they are interpreted as a label.

iloc is primarilly integer based indexing to select a subset of rows and columns from our DataFrame, we can  use the iloc methoed.

In [115]:
# use if loc(label based)

data.loc["Utah":"Texas", "jan": "Mar"]

            jan  Feb  Mar
Utah         16   17   18
New York     20   21   22
California   24   25   26
Texas        28   29   30

In [116]:
# use if loc (integer based)
data.iloc[2:6,0:2]

            jan  Feb
Washington    8    9
Nebraska     12   13
Utah         16   17
New York     20   21

In [117]:
a = pd.DataFrame({"p":[2,4,6]})
a.rdiv(2) # 2/6

          p
0  1.000000
1  0.500000
2  0.333333

In [118]:
# select all the data from the month  of march that have value greater than 15
data["Mar"]>15

Ohio          False
Colorado      False
Washington    False
Nebraska      False
Utah           True
New York       True
California     True
Texas          True
Georgia        True
Alaska         True
Name: Mar, dtype: bool

In [119]:
data[data["Mar"]>20]

            jan  Feb  Mar  Apr
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31
Georgia      32   33   34   35
Alaska       36   37   38   39

In [120]:
data[data< 5] = 0
data

            jan  Feb  Mar  Apr
Ohio          0    0    0    0
Colorado      0    5    6    7
Washington    8    9   10   11
Nebraska     12   13   14   15
Utah         16   17   18   19
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31
Georgia      32   33   34   35
Alaska       36   37   38   39

# What are Lambda Functions?

A lambda function is a small function containing a single expression.Lambda functions can also act as anonymous functions where they don't require any name.These are very
helpful when we have to perform small tasks with less code.

Lambda function are handy and used in many programming languages but we'll be focusing on using them in python here.
In python, lambda functions have the following syntax:

lambda x: x

# IIFES using lambda functions

IIFES are immediately Invoked Function Expressions. These are functions that are executed as soon as they are created.IIFES require no explicit call to invoke the function.In python,IIFEs can  be created 
using the lambda function.

Here,created an IIFE that returns the cube of a number:
    (lambda x: x*x*X)(10)

# Application of Lambda Functions with Different Functions

created a random dataset that contains information about a family of 5 people with their id,ages,and income per month.I will be using this 
dataframe to show you how to apply lambda functions using different functions on a dataframe in python.

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'id':[1,2,3,4,5], 'name':['Asad','saad','Numi','Roman','Maria'], 'age':[20,25,15,10,30], 'income':[4000,7000,200,0,10000]})
df

   id   name  age  income
0   1   Asad   20    4000
1   2   saad   25    7000
2   3   Numi   15     200
3   4  Roman   10       0
4   5  Maria   30   10000

# Application of Lambda with Apply

Let's say we have got an error in the age variable. We recorded ages with a difference of 3 years.So,to remove this error from the 
pandas dataframe,we have to add three years to every person's age.
We can do this with the apply()function in pandas.

apply() function in pandas calls the lambda function and applies it to every row or column of the dataframe and returns a modified 
copy of the datafrmae

In [3]:
df['age'] = df.apply(lambda x: x
['age']+3, axis = 'columns') # on frame
df

   id   name  age  income
0   1   Asad   23    4000
1   2   saad   28    7000
2   3   Numi   18     200
3   4  Roman   13       0
4   5  Maria   33   10000

# Application of Lambda with Filter

Now,let's see how many of these people are above the age of 18.

we can do this using the filter()function.

The filter() function takes a lambda function and a pandas series  and applies the lambda function on the series and filter the data.

In [4]:
list(filter(lambda x: x >18, df['age']))

[23, 28, 33]

# Application of Lambda with MAP

You'll be able to relate to the next statement. It's performance appraisal time and the income of all the employees gets increased
 by 20%. This means we have to increase the salary of each person by 20% in our pandas dataframe.
    
we can do this using the map() function.This map() function maps the series according to input correspondence. It is very helpful when we have to substitute a 
series with other values.

In [5]:
df['income2'] = df['income'].apply(lambda x: x+x*.2)
df

   id   name  age  income  income2
0   1   Asad   23    4000   4800.0
1   2   saad   28    7000   8400.0
2   3   Numi   18     200    240.0
3   4  Roman   13       0      0.0
4   5  Maria   33   10000  12000.0

# Conditional Statements using Lambda Functions

Lambda functions also support conditional statements, such as if.else. This makes lambda functions very powerful.

Let's say in the family dataframe we have to categorize people into 'Adult' or 'Child'. For this, we can simply apply the lambda function
to our dataframe:

In [6]:
df['category'] = df['age'].apply(lambda x: 'Adult' if x>=18 else 'Child')
df

   id   name  age  income  income2 category
0   1   Asad   23    4000   4800.0    Adult
1   2   saad   28    7000   8400.0    Adult
2   3   Numi   18     200    240.0    Adult
3   4  Roman   13       0      0.0    Child
4   5  Maria   33   10000  12000.0    Adult

# Lambda with Reduce

Now,let's see the total income of the family.TO calculate this,we can use the reduce() function in python.It is used to apply a particular function to the list of  elements in the sequence.The reduce()
function is defined in the 'functions' module.

For using the reduce() function, we have to import the functools module first:

In [7]:
import functools
functools.reduce(lambda a,b: a+b,df['income'])

21200